const labels = ['ナイトメア','ピッグ','カニバル','ドクター','スピリット','シェイプ',"ゴーストフェイス","ハグ","トラッパー","リージョン","鬼","ヒルビリー","エクセキューショナー","デススリンガー","ハントレス","クラウン","レイス","デモゴルゴン","ブライト","プレイグ","ナース"];
const data = {
  labels: labels,
  datasets: [{
    label: 'DBD　キラー殺傷率',
    data: [66.00, 62.09, 62.04, 60.33,60.19, 59.76, 58.92, 58.74,58.12,57.33,56.27,55.42,55.38,54.74,54.41,54.40,53.09,51.38,50.95,50.61,40.29,],
    backgroundColor: [
      'rgba(255, 99, 132, 0.2)',
      'rgba(255, 159, 64, 0.2)',
      'rgba(255, 205, 86, 0.2)',
      'rgba(75, 192, 192, 0.2)',
      'rgba(54, 162, 235, 0.2)',
      'rgba(153, 102, 255, 0.2)',
      'rgba(201, 203, 207, 0.2)',
      'rgba(21, 209, 237, 0.2)',
      'rgba(231, 213, 7, 0.2)',
      'rgba(253, 105, 2, 0.2)',
      'rgba(278, 77, 117, 0.2)',
      'rgba(132, 222, 203, 0.2)',
      'rgba(154, 111, 222, 0.2)',
      'rgba(166, 100, 200, 0.2)',
      'rgba(189, 166, 233, 0.2)',
      'rgba(21, 190, 209, 0.2)',
      'rgba(89, 108, 107, 0.2)',
      'rgba(51, 133, 187, 0.2)',
      'rgba(211, 215, 197, 0.2)',
      'rgba(219, 23, 32, 0.2)',
      'rgba(69, 6, 2, 0.2)'

    ],
    borderColor: [
      'rgb(255, 99, 132)',
      'rgb(255, 159, 64)',
      'rgb(255, 205, 86)',
      'rgb(75, 192, 192)',
      'rgb(54, 162, 235)',
      'rgb(153, 102, 255)',
      'rgb(201, 203, 207)',
      'rgb(21, 209, 237)',
      'rgb(231, 213, 7)',
      'rgb(253, 105, 207)',
      'rgb(278, 77, 117)',
      'rgb(132, 222, 203)',
      'rgb(154, 111, 222)',
      'rgb(166, 100, 200)',
      'rgb(189, 166, 233)',
      'rgb(21, 190, 209)',
      'rgb(89, 108, 107)',
      'rgb(51, 133, 187)',
      'rgb(211, 215, 197)',
      'rgb(219, 23, 32)',
      'rgb(69, 6, 2,)'
    ],
    borderWidth: 1
  }]
};
const config = {
    type: 'bar',
    data: data,
    options: {
        scales: {
            y: {
            beginAtZero: true
            }
        }
    },
};
var barchart = new Chart(
    document.getElementById('b'),
    config,
);